[
  {
    "role": "Software Developer",
    "organisation": "Ocean Health Systems",
    "startDate": "Jan 2024",
    "endDate": "Present",
    "summary": "Software Developer delivering Microsoft Power Platform solutions including Canvas Apps and Power Automate to improve day to day healthcare operations. Also supports .NET and Angular applications with a focus on secure integration, data protection, and reliable delivery through Azure DevOps.",
    "techStack": "Power Apps (Canvas), Power Automate, Power Fx, Angular 12–21, TypeScript, PrimeNG, Tailwind CSS, .NET 8, Wordpress, Webflow, Auth0, REST API, Azure DevOps, Playwright",
    "experiences": [
      "Reduced manual processing by digitising internal workflows using Canvas Apps.",
      "Improved turnaround times by automating approvals, notifications, and system updates using Power Automate.",
      "Applied role based access controls and audit logging to support secure handling of sensitive healthcare data.",
      "Integrated with external systems including the Australian Immunisation Register (AIR) via REST APIs using Auth0 secured authentication.",
      "Cut regression testing time by 40% by introducing Playwright E2E automation in Azure DevOps pipelines.",
      "Integrated WordPress and Webflow with modern frontend workflows for scalable digital platforms.",
      "Improved performance by 25% through Angular standalone migration and frontend optimisation."
    ],
    "icon": "hospital"
  },
  {
    "role": "Frontend Engineer",
    "organisation": "Vocus Group (Dodo / iPrimus)",
    "startDate": "Oct 2021",
    "endDate": "Jan 2024",
    "summary": "Frontend Engineer within the Digital team delivering scalable customer portals for telecom and energy products, focused on UX, conversion, and API integration.",
    "techStack": "Angular, TypeScript, PrimeNG, Salesforce, MuleSoft, REST API, NgRx, Azure, GitHub, CI/CD",
    "experiences": [
      "Developed and enhanced responsive sales funnels for mobile, broadband, and energy services, improving conversion rates and engagement.",
      "Maintained and upgraded the MyDodo self-service portal, enabling customers to manage internet, mobile, and energy accounts seamlessly.",
      "Integrated Salesforce CRM and MuleSoft REST APIs for synchronised customer, billing, and order data using OpenAPI specs.",
      "Implemented UX and performance improvements that reduced support calls and boosted online retention.",
      "Mentored junior developers and contributed to design discussions focusing on scalability, accessibility, and frontend best practices."
    ],
    "icon": "building"
  },
  {
    "role": "Software Developer",
    "organisation": "ITechYouLearn Pty Ltd (EdTech)",
    "startDate": "Mar 2019",
    "endDate": "Sep 2020",
    "summary": "Software Developer building and maintaining university-scale e-learning platforms and serverless applications, integrating .NET and AWS-based solutions.",
    "techStack": "Angular, JavaScript, TypeScript, HTML5, CSS3, .NET Core, Node.js, AWS Lambda, EC2, PostgreSQL, Jasmine, Karma",
    "experiences": [
      "Built and maintained an e-learning platform serving 10,000+ users with course delivery, assessments, and student progress tracking.",
      "Developed Angular components and responsive layouts ensuring accessibility across devices and browsers.",
      "Deployed and monitored production workloads on AWS Lambda and EC2, improving uptime and scalability.",
      "Integrated Node.js and .NET APIs for content management and authentication workflows with focus on security and performance.",
      "Optimised frontend performance by profiling components and reducing load times through asset compression and caching."
    ],
    "icon": "laptop"
  }
]