[
  {
    "role": "Software Engineer",
    "organisation": "Ocean Health Systems",
    "startDate": "Jan 2024",
    "endDate": "Present",
    "summary": "Frontend-focused Software Engineer developing secure, high-performance healthcare web applications using Angular and .NET 8. Responsible for UI/UX design, data confidentiality, and CI/CD delivery through Azure DevOps.",
    "techStack": "Angular 17–21, TypeScript, PrimeNG, Tailwind CSS, .NET 8, Auth0, REST API, Azure DevOps, Playwright",
    "experiences": [
      "Designed and implemented the Immuniser Dashboard, centralising vaccination management across hospitals and improving efficiency.",
      "Handled sensitive hospital staff vaccination data with strict confidentiality, implementing role-based access and audit logging.",
      "Integrated with the Australian Immunisation Register (AIR) via REST APIs using Auth0-secured authentication and token management.",
      "Automated Playwright E2E testing within Azure CI/CD pipelines, improving release reliability and cutting regression time by 40%.",
      "Migrated frontend modules to Angular standalone architecture, improving maintainability and reducing load time by 25%."
    ],
    "icon": "hospital"
  },
  {
    "role": "Frontend Engineer",
    "organisation": "Vocus Group (Dodo / iPrimus)",
    "startDate": "Oct 2021",
    "endDate": "Jan 2024",
    "summary": "Frontend Engineer within the Digital team delivering scalable customer portals for telecom and energy products, focused on UX, conversion, and API integration.",
    "techStack": "Angular, TypeScript, PrimeNG, Salesforce, MuleSoft, REST API, NgRx, Azure, GitHub, CI/CD",
    "experiences": [
      "Developed and enhanced responsive sales funnels for mobile, broadband, and energy services, improving conversion rates and engagement.",
      "Maintained and upgraded the MyDodo self-service portal, enabling customers to manage internet, mobile, and energy accounts seamlessly.",
      "Integrated Salesforce CRM and MuleSoft REST APIs for synchronised customer, billing, and order data using OpenAPI specs.",
      "Implemented UX and performance improvements that reduced support calls and boosted online retention.",
      "Mentored junior developers and contributed to design discussions focusing on scalability, accessibility, and frontend best practices."
    ],
    "icon": "building"
  },
  {
    "role": "Software Developer",
    "organisation": "ITechYouLearn Pty Ltd (EdTech)",
    "startDate": "Mar 2019",
    "endDate": "Sep 2020",
    "summary": "Software Developer building and maintaining university-scale e-learning platforms and serverless applications, integrating .NET and AWS-based solutions.",
    "techStack": "Angular, TypeScript, HTML5, CSS3, .NET Core, AWS Lambda, EC2, PostgreSQL, Jasmine, Karma",
    "experiences": [
      "Built and maintained an e-learning platform serving 10,000+ users with course delivery, assessments, and student progress tracking.",
      "Developed Angular components and responsive layouts ensuring accessibility across devices and browsers.",
      "Deployed and monitored production workloads on AWS Lambda and EC2, improving uptime and scalability.",
      "Integrated .NET APIs for content management and authentication workflows with focus on security and performance.",
      "Optimised frontend performance by profiling components and reducing load times through asset compression and caching."
    ],
    "icon": "laptop"
  }
]